railsprojects/app/controllers/news_posts_controller.rb

  def index
    @news_posts = NewsPost.all :order => "created_at DESC", :limit => @page_size
---
SELECT * FROM "news_posts" ORDER BY created_at DESC LIMIT 2

  def show
    @news_post = NewsPost.find(params[:id])
---
SELECT * FROM "news_posts" WHERE ("news_posts"."id" = 1)

  def edit
    @news_post = NewsPost.find(params[:id])
---
SELECT * FROM "news_posts" WHERE ("news_posts"."id" = 1)

  def create
    params[:user] = session[:user]
    @news_post = NewsPost.new(params[:news_post])

    if @news_post.save
---
INSERT INTO "news_posts" ("updated_at", "title", "contents", "user_id", "image", "created_at") VALUES('2009-08-29 21:01:13', NULL, NULL, NULL, NULL, '2009-08-29 21:01:13')

  def update
    @news_post = NewsPost.find(params[:id])
---
SELECT * FROM "news_posts" WHERE ("news_posts"."id" = 2053932785)

  def destroy
    @news_post = NewsPost.find(params[:id])
    @news_post.destroy
---
SELECT * FROM "news_posts" WHERE ("news_posts"."id" = 2053932785)
DELETE FROM "news_posts" WHERE "id" = 2053932785