railsprojects/guildwebsite/app/controllers/forum_categories_controller.rb

  def index
    @forum_categories = ForumCategory.all(:order => "priority DESC")
---
SELECT * FROM `forum_categories`