railsprojects/guildwebsite/app/controllers/forum_topics_controller.rb

SELECT * FROM `forum_topics`
---
  def index
    @forum_topics = ForumTopic.all

SELECT * FROM `forum_topics` WHERE (`forum_topics`.`id` = 5)
SELECT * FROM `forum_posts` WHERE (`forum_posts`.forum_topic_id = 1) ORDER BY id ASC
---
  def show
    @forum_topic = ForumTopic.find(params[:id])
    @posts = @forum_topic.forum_posts.find(:all, :order => "created_at ASC")