railsprojects/guildwebsite/app/controllers/news_posts_controller.rb

  def index
    @news_posts = NewsPost.all :order => "created_at DESC", :limit => @page_size
---
SELECT * FROM `news_posts` ORDER BY created_at DESC LIMIT 5

  def show
    @news_post = NewsPost.find(params[:id])
---
SELECT * FROM `news_posts` WHERE (`news_posts`.`id` = 1)

  def edit
    @news_post = NewsPost.find(params[:id])
---
SELECT * FROM "news_posts" WHERE ("news_posts"."id" = 1)