railsprojects/guildwebsite/app/controllers/users_controller.rb

  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save
---
INSERT INTO "users" ("name", "salt", "updated_at", "crypted_password", "remember_token_expires_at", "remember_token", "login", "email", "created_at") VALUES('', '5ed6cb241b7b7c47c42b4bb59665a924907f7bc7', '2009-08-29 16:46:08', '0c213b9d718474686bb70626aa63fea78de2869c', NULL, NULL, 'domia', 'asuah@gatech.edu', '2009-08-29 16:46:08')